{
  "version": "turkquish-char-vocab-v1",
  "created_at": "2026-06-10T20:30:00.624020Z",
  "pad_token": "<PAD>",
  "unk_token": "<UNK>",
  "pad_idx": 0,
  "unk_idx": 1,
  "chars": "abcdefghijklmnopqrstuvwxyz0123456789.-_/:?=&%@+~#!$*()[]{}|\\;,<>\"' 챌휓캇철힊체창챤",
  "char2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "a": 2,
    "b": 3,
    "c": 4,
    "d": 5,
    "e": 6,
    "f": 7,
    "g": 8,
    "h": 9,
    "i": 10,
    "j": 11,
    "k": 12,
    "l": 13,
    "m": 14,
    "n": 15,
    "o": 16,
    "p": 17,
    "q": 18,
    "r": 19,
    "s": 20,
    "t": 21,
    "u": 22,
    "v": 23,
    "w": 24,
    "x": 25,
    "y": 26,
    "z": 27,
    "0": 28,
    "1": 29,
    "2": 30,
    "3": 31,
    "4": 32,
    "5": 33,
    "6": 34,
    "7": 35,
    "8": 36,
    "9": 37,
    ".": 38,
    "-": 39,
    "_": 40,
    "/": 41,
    ":": 42,
    "?": 43,
    "=": 44,
    "&": 45,
    "%": 46,
    "@": 47,
    "+": 48,
    "~": 49,
    "#": 50,
    "!": 51,
    "$": 52,
    "*": 53,
    "(": 54,
    ")": 55,
    "[": 56,
    "]": 57,
    "{": 58,
    "}": 59,
    "|": 60,
    "\\": 61,
    ";": 62,
    ",": 63,
    "<": 64,
    ">": 65,
    "\"": 66,
    "'": 67,
    " ": 68,
    "챌": 69,
    "휓": 70,
    "캇": 71,
    "철": 72,
    "힊": 73,
    "체": 74,
    "창": 75,
    "챤": 76
  },
  "idx2char": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "a",
    "3": "b",
    "4": "c",
    "5": "d",
    "6": "e",
    "7": "f",
    "8": "g",
    "9": "h",
    "10": "i",
    "11": "j",
    "12": "k",
    "13": "l",
    "14": "m",
    "15": "n",
    "16": "o",
    "17": "p",
    "18": "q",
    "19": "r",
    "20": "s",
    "21": "t",
    "22": "u",
    "23": "v",
    "24": "w",
    "25": "x",
    "26": "y",
    "27": "z",
    "28": "0",
    "29": "1",
    "30": "2",
    "31": "3",
    "32": "4",
    "33": "5",
    "34": "6",
    "35": "7",
    "36": "8",
    "37": "9",
    "38": ".",
    "39": "-",
    "40": "_",
    "41": "/",
    "42": ":",
    "43": "?",
    "44": "=",
    "45": "&",
    "46": "%",
    "47": "@",
    "48": "+",
    "49": "~",
    "50": "#",
    "51": "!",
    "52": "$",
    "53": "*",
    "54": "(",
    "55": ")",
    "56": "[",
    "57": "]",
    "58": "{",
    "59": "}",
    "60": "|",
    "61": "\\",
    "62": ";",
    "63": ",",
    "64": "<",
    "65": ">",
    "66": "\"",
    "67": "'",
    "68": " ",
    "69": "챌",
    "70": "휓",
    "71": "캇",
    "72": "철",
    "73": "힊",
    "74": "체",
    "75": "창",
    "76": "챤"
  },
  "vocab_size": 77,
  "important_note": "This vocabulary must exactly match the character-to-index mapping used when url_transformer_best.pt was trained."
}